ehealth_connector-communication/ehealth_connector-ppq/log/TestEHC.log

Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:AddPolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:2f8046c3-190c-4887-8214-feb752360d97</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:AddPolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_b882d240-45cd-4fa3-aa9f-65394115d0e0" IssueInstant="2019-03-06T15:28:35.249+01:00"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer><ns3:Statement xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns9:XACMLPolicyStatementType"><ns2:PolicySet PolicySetId="urn:uuid:451fb3f6-7b35-4344-bee1-ddc26018cab3" Version="1.0" PolicyCombiningAlgId="urn:oasis:names:tc:xacml:1.1:policy-combining-algorithm:ordered-deny-overrides"><ns2:Description>Patient specific PolicySet for EPD Setup 201 -
				granting full access to a patient at EPD setup</ns2:Description></ns2:PolicySet></ns3:Statement></ns3:Assertion></ns7:AddPolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:db056ced-f66b-4b22-8443-8b00fdc8491c</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="_9a71a18c-d7a7-4931-9168-150a8fbc5dc2" IssueInstant="2017-11-16T04:34:53.000+01:00"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:952f97cb-f0fc-4e04-8be8-6e9999d79186</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:UpdatePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:e376b90d-3fc1-4f0d-8713-8e9da393dfa1</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:UpdatePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="_b882d240-45cd-4fa3-aa9f-65394115d0e0" IssueInstant="2014-04-09T21:10:00.294+02:00"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:UpdatePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:UpdatePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:09b8350f-e0e2-4dcd-aff5-66f3a92f52c5</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:UpdatePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="_b882d240-45cd-4fa3-aa9f-65394115d0e0" IssueInstant="2014-04-09T21:10:00.294+02:00"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:UpdatePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:6d4779ff-f767-4d83-a0e4-53c3b6b72cc2</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:a75169b7-97c9-4935-9b7d-9e129f0aad0c</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns11="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns10="urn:hl7-org:v3" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:UpdatePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:9fb80098-d388-427c-99d2-e9d825524815</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:UpdatePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="_b882d240-45cd-4fa3-aa9f-65394115d0e0" IssueInstant="2014-04-09T21:10:00.294+02:00"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:UpdatePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:520579c8-703c-492d-9198-277a8a22dc70</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns11="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns10="urn:hl7-org:v3" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:88fc1d2c-7f14-40a7-a710-57669e06010d</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns11="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns10="urn:hl7-org:v3" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:9462fa6e-024a-4c01-a445-c6f976d67258</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:hl7-org:v3" xmlns:ns11="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns10="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>Target endpoint: https://ehealthsuisse.ihe-europe.net:10443/ppq-repository
Character set: UTF-8

Accept: */*

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:e-health-suisse:2015:policy-administration:DeletePolicy</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:bf4549b7-7be3-4f4e-8b83-01604c5b989a</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://ehealthsuisse.ihe-europe.net:10443/ppq-repository</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns7:DeletePolicyRequest xmlns:ns12="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:protocol" xmlns:ns11="urn:oasis:names:tc:SAML:2.0:protocol" xmlns:ns10="urn:hl7-org:v3" xmlns:ns9="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:ns8="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ns7="urn:e-health-suisse:2015:policy-administration" xmlns:ns6="http://www.w3.org/2004/08/xop/include" xmlns:ns5="http://www.w3.org/2001/04/xmlenc#" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:ns2="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns="urn:oasis:names:tc:xacml:2.0:context:schema:os"><ns3:Assertion Version="2.0" ID="\_9a71a18c-d7a7-4931-9168-150a8fbc5dc2"><ns3:Issuer>urn:oid:1.3.6.1.4.1.21367.2017.2.6.2</ns3:Issuer></ns3:Assertion></ns7:DeletePolicyRequest></soap:Body></soap:Envelope>